const featuresDictionary = {
    NOUN: {
        Case: {
          label: "Жондомосу",
          values: {
            Nom: "Атооч",    // Именительный
            Gen: "Илик",     // Родительный
            Dat: "Барыш",    // Дательный
            Acc: "Табыш",    // Винительный
            Loc: "Жатыш",    // Местный
            Abl: "Чыгыш",    // Исходный
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик",  // Единственное
            Plur: "Көптүк",   // Множественное
          },
        },
        Person: {
          label: "Жагы",
          values: {
            "1": "Биринчи",   // Первый
            "2": "Экинчи",    // Второй
            "3": "Үчүнчү",    // Третий
          },
        },
    },
    PRON: {
        Case: {
          label: "Жондомосу",
          values: {
            Nom: "Атооч",  // Именительный
            Gen: "Илик",   // Родительный
            Dat: "Барыш",  // Дательный
            Acc: "Табыш",  // Винительный
            Loc: "Жатыш",  // Местный
            Abl: "Чыгыш",  // Исходный
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик",  // Единственное
            Plur: "Көптүк",   // Множественное
          },
        },
        Person: {
          label: "Жагы",
          values: {
            "1": "Биринчи",  // Первый
            "2": "Экинчи",   // Второй
            "3": "Үчүнчү",   // Третий
          },
        },
        PronType: {
            label: "Ат атоочтун түрү",
            values: {
                Prs: "Жактама ат атооч", //Пример: мен, сен, ал, биз, силер, алар
                Dem: "Шилтеме ат атооч", //Пример: бул, тиги, ушул
                Int: "Сурама ат атооч", //Пример: ким, эмне, кайсы, канча, кайдан, кандай
                Neg: "Таңгыч ат атооч", //Пример: эч ким, эч нерсе, эч бир
                Def: "Аныктама ат атооч", //Пример: бүткүл, бардык, ар ким, ар бир, өз
                Ind: "Белгисиз ат атооч", //Пример: кайсы кимдир бирөө, алда кандай, бир нерсе, кай бир
            }
        }
    },
    PROPN:  {
        Case: {
          label: "Жондомосу",
          values: {
            Nom: "Атооч",    // Именительный
            Gen: "Илик",     // Родительный
            Dat: "Барыш",    // Дательный
            Acc: "Табыш",    // Винительный
            Loc: "Жатыш",    // Местный
            Abl: "Чыгыш",    // Исходный
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик",  // Единственное
            Plur: "Көптүк",   // Множественное
          },
        },
        Person: {
          label: "Жагы",
          values: {
            "1": "Биринчи",   // Первый
            "2": "Экинчи",    // Второй
            "3": "Үчүнчү",    // Третий
          },
        },
    },   
    ADJ: {
        Degree: {
          label: "Даражасы",
          values: {
            Pos: "Жай даража",    // Положительная степень (обычный)
            Comp: "Салыштырма жаража",       // Сравнительная степень (более)
            Superl: "Күчөтмө даража", // Превосходная степень (самый)
          },
        },
    },
    NUM:{
        NumType:{
            label: "Сан атоочтун түрү",
            values:{
                Card: "Эсептик сан", //Примеры: "Он", "Жыйырма", "Кырк", "Эки жүз", "Миллион".
                Ord: "Иреттик сан", //Примеры: "Биринчи", "Экинчи", "Үчүнчү", "Жыйырманчы".
                Set: "Жамдама сан", //Примеры: "Бирөө", "Экөө", "Үчөө", "Төртөө", "Бешөө", "Алтоо", "Жетөө".
                App: "Чамалама сан", //Примеры: "Ондой", "Жыйырмача", "Кырктай", "Жүзгө жакын", "Отуз чакты".
                Mult: "Топ сан", //Примеры: "Үч — үчтөн", "Беш — алтыдан", "Отуз — кырктан".
                Frac: "Бөлчөк сан", //римеры: "Экиден бир", "Бештен үч", "Сегиз бүтүн ондон бир".
            }
        }
    }, 
    VERB: {
        Tense: {
          label: "Чагы",
          values: {
            Pres: "Учур",  // Настоящее
            Past: "Өткөн",   // Прошедшее
            Fut: "Келээр",  // Будущее
          },
        },
        Person: {
          label: "Жагы",
          values: {
            "1": "Биринчи",  // Первый
            "2": "Экинчи",   // Второй
            "3": "Үчүнчү",   // Третий
          },
        },
        Number: {
          label: "Саны",
          values: {
            Sing: "Жекелик",  // Единственное
            Plur: "Көптүк",   // Множественное
          },
        },
        Mood: {
          label: "Ыңгайлары",
          values: {
            Imp: "Буйрук",       
            Cnd: "Шарттуу", 
            Pot: "Максат-ниет",
            PotDes: "Каалоо-тилек",
            Ind: "Баяндагыч"
            },
        },
        Polarity:{
            label: "Формасы",
            values: {
                Neg: "Терс",
                Pos: "Оң"
            }
        },
        Voice:{
            label: "Мамилелери",
            values:{
                Act: "Негизги мамиле",
                Rcp: "Кош мамиле",
                Mid: "Өздүк мамиле",
                Pass: "Туюк мамиле", 
                Cau: "Аркылуу мамиле"
            }
        }
    },

}